# 51 구구단

print('''
          Multiplication Table
      1   2   3   4   5   6   7   8   9
---------------------------------------
1 |   1   2   3   4   5   6   7   8   9
2 |   1   2   3   4   5   6   7   8   9
3 |   1   2   3   4   5   6   7   8   9
4 |   1   2   3   4   5   6   7   8   9
5 |   1   2   3   4   5   6   7   8   9
6 |   1   2   3   4   5   6   7   8   9
7 |   1   2   3   4   5   6   7   8   9
8 |   1   2   3   4   5   6   7   8   9
9 |   1   2   3   4   5   6   7   8   9
''')

print('''
          Multiplication Table
      1   2   3   4   5   6   7   8   9
---------------------------------------
''', end='')
for i in range(1, 9+1):
    print(f'{i} |   1   2   3   4   5   6   7   8   9')


print('''
          Multiplication Table
      1   2   3   4   5   6   7   8   9
---------------------------------------
''', end='')
for i in range(1, 9+1):
    print(f'{i} |',end='')
    for j in range(1, 9+1):
        print(f'{i * j:4d}', end='')
    print()


